api/modules/v1/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['token' => $token]);
---
SELECT * FROM `users` WHERE `token`='JKi1a6WxuNbAPw05t2c7twE9bQx6iO1trswJONy3NTw-gem8ksHOkNnpcSBuD3VS'

    public static function issetUser($phone)
    {
        $userObject = User::find()->where(array('phone' => $phone))->orderBy(['id' => SORT_DESC])->asArray()->One();
---
SELECT * FROM `users` WHERE `phone`='9878676434' ORDER BY `id` DESC

    public static function registrationUser($request)
    {
        $password = static::generatePassword(8);
        $phone = static::trimPhone($request['phone']);
        if(mb_strlen($phone) != 10){
            throw new HttpException(400, sprintf('Invalid value specified.'));
        }
        $fullname = $request['fullname'];
        if(!static::issetUser(static::trimPhone($phone))) {
            $user = new User;
            $user->phone = $phone;
            $user->fullname = $fullname;
            $user->password = password_hash($password, PASSWORD_DEFAULT);
            try {
                $user->token = Yii::$app->security->generateRandomString(64);
            } catch (Exception $e) {
                $response = [
                    'status' => 'error',
                    'message' => $e,
                ];
            }
            $user->photo = $phone;
            $user->email = $phone."@sample.ru";
            $user->save();
---
INSERT INTO `users` (`phone`, `fullname`, `password`, `token`, `photo`, `email`) VALUES ('9878676434', 'ормормплормлор', '$2y$10$wW6sOPxPQVQCljFEOK1KL.hQw68/l2C1tAinltDBsFaGcFYM0vHg2', '_u74Zmjd42y0Nxy7sJE_0llVwd7IdLAJkMPd9el7hiyu_J5VtlfiQ_oYoEZhP9c7', '9878676434', '9878676434@sample.ru')

    public static function isLoggedUser($request)
    {
        $response = array();
        try {
            $token = $request['token'];
            $user = static::findByUserToken($token);
            if ($user) {
                try {
                    $user->token = Yii::$app->security->generateRandomString(64);
                    $user->save();
---
UPDATE `users` SET `token`='Xz5NKtYCUrfS-pQhD0PMpwHx433S35RJiZQO2Y0t-ZNqS26nRnBGT6-cFGI1BL4L' WHERE `id`=23

    public static function findByUsername($phone)
    {
        return static::findOne(['phone' => $phone]);
---
SELECT * FROM `users` WHERE `phone`='79841147451'

    public static function findByUserToken($token)
    {
        return static::findOne(['token' => $token]);
---
SELECT * FROM `users` WHERE `token`='w5SECFCo35FvON1qTKCSvTG9IoNkjWvZVfX0L72gDdDV-yO1ADTePeGJ_kaV5pD7'